driver-tests/bpelse/correlation/CorrelationJBI2/test/6573863/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://j2ee.netbeans.org/wsdl/parentWS">
  <soapenv:Body>
    <par:parentWSOperation>
      <part1>hello from client</part1>
      <part2>call back to parent</part2>
    </par:parentWSOperation>
  </soapenv:Body>
</soapenv:Envelope>